<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"web1/production","backend":"82fceaf0fc566c8419e2aff96e546ebe6e0a5419d87c634713a70f7597e8b781","plan_job_ref":"Job Generate OpenTofu Plan #113 at https://github.com/alexdragongc/test-vercel-backend-hello-world-iac/actions/runs/22228409253","plan_out_hash":"cfad058a5bc61e1fb22f78fab2fffb288f5fcc38f1012c6a703a523a9218dc15","plan_hash":"a42998aec6dbe6a70de898dd09f9f371ee2fe8b8fe87d42f33b824db1f213070","plan_text_format":"diff","version":"2.2.3"} -->
OpenTofu plan for __web1/production__
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place (current -> planned)

OpenTofu will perform the following actions:

  # vercel_project.my_project will be updated in-place
!~  resource "vercel_project" "my_project" {
+       build_machine_type                                = (known after apply)
+       enable_preview_feedback                           = (known after apply)
+       git_provider_options                              = (known after apply)
!~      git_repository                                    = {
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change.
!~          deploy_hooks      = (sensitive value)
#            (3 unchanged attributes hidden)
        }
        id                                                = "prj_LNiPwjtv3VyAzq23rCnWH0t10MCi"
        name                                              = "web1"
+       preview_comments                                  = (known after apply)
+       protection_bypass_for_automation_secret           = (sensitive value)
!~      resource_config                                   = {
+           function_default_cpu_type = (known after apply)
+           function_default_timeout  = (known after apply)
#            (2 unchanged attributes hidden)
        }
!~      serverless_function_region                        = "iad1" -> (known after apply)
+       team_id                                           = (known after apply)
#        (18 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Generate OpenTofu Plan #113](https://github.com/alexdragongc/test-vercel-backend-hello-world-iac/actions/runs/22228409253)